app/Controllers/Admin/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'admin@kagziventures.com'
AND `role` = 'admin'
---
    public function loginProcess()
    {
        $email    = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        $db   = \Config\Database::connect();
        $user = $db->table('users')->where('email', $email)->where('role', 'admin')->get()->getRowArray();