app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $totalProducts   = $productModel->countAllResults();
        $totalCategories = $categoryModel->countAllResults();
        $featuredCount   = $productModel->where('featured', 1)->countAllResults();
        $recentProducts  = $productModel->select('products.*, categories.name as category_name')
                                        ->join('categories', 'categories.id = products.category_id', 'left')
                                        ->orderBy('products.id', 'DESC')
                                        ->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `categories`
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `featured` = 1
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
ORDER BY `products`.`id` DESC
 LIMIT 5