app/Controllers/Admin/Products.php

    public function index()
    {
        $productModel = new ProductModel();
        $products     = $productModel->select('products.*, categories.name as category_name')
                                     ->join('categories', 'categories.id = products.category_id', 'left')
                                     ->orderBy('products.id', 'DESC')
                                     ->findAll();
---
SELECT `products`.*, `categories`.`name` as `category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
ORDER BY `products`.`id` DESC

    public function edit(int $id)
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        $product = $productModel->find($id);
        if (!$product) {
            return redirect()->to(base_url('admin/products'))->with('error', 'Product not found.');
        }

        $categories = $categoryModel->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`id` = 8
SELECT *
FROM `categories`
ORDER BY `name` ASC