app/Controllers/Shop.php

    public function index(?string $categorySlug = null)
    {
        $productModel  = new ProductModel();
        $categoryModel = new CategoryModel();

        // Get query parameters
        $catParam    = $this->request->getGet('category') ?? $categorySlug;
        $searchQuery = $this->request->getGet('q');
        $sort        = $this->request->getGet('sort') ?? 'default';

        $allCategories = $categoryModel->getActiveCategories();
        $currentCategory = null;

        if (!empty($catParam)) {
            $currentCategory = $categoryModel->where('slug', $catParam)->where('status', 1)->first();
---
SELECT *
FROM `categories`
WHERE `slug` = 'accessories'
AND `status` = 1
 LIMIT 1