app/Models/CategoryModel.php

SELECT *
FROM `categories`
WHERE `status` = 1
ORDER BY `name` ASC
---
    public function getActiveCategories()
    {
        return $this->where('status', 1)->orderBy('name', 'ASC')->findAll();