app/Models/ProductModel.php

    public function getFeaturedProducts(int $limit = 8)
    {
        return $this->select('products.*, categories.name as category_name, categories.slug as category_slug')
                    ->join('categories', 'categories.id = products.category_id', 'left')
                    ->where('products.status', 1)
                    ->where('products.featured', 1)
                    ->orderBy('products.id', 'DESC')
                    ->findAll($limit);
---
SELECT `products`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 1
AND `products`.`featured` = 1
ORDER BY `products`.`id` DESC
 LIMIT 8

    public function getTrendingProducts(int $limit = 8)
    {
        return $this->select('products.*, categories.name as category_name, categories.slug as category_slug')
                    ->join('categories', 'categories.id = products.category_id', 'left')
                    ->where('products.status', 1)
                    ->where('products.is_trending', 1)
                    ->orderBy('products.id', 'DESC')
                    ->findAll($limit);
---
SELECT `products`.*, `categories`.`name` as `category_name`, `categories`.`slug` as `category_slug`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
WHERE `products`.`status` = 1
AND `products`.`is_trending` = 1
ORDER BY `products`.`id` DESC
 LIMIT 8